In [1]:
print('hello')

hello

In [2]:
import numpy as np 
import pandas as pd

In [3]:
i = 45
i= i+3
print(i)

48

In [12]:
dict1 = { 'name' : ['Abhi' , 'Samarth' , 'Kejri', 'Sameer'],
          'marks':[40,42,39,37],
          'city':['Mumbai' , 'Delhi', 'Ranchi' , 'Vijayawada']
        }

In [13]:
df = pd.DataFrame(dict1)

In [14]:
df

      name  marks        city
0     Abhi     40      Mumbai
1  Samarth     42       Delhi
2    Kejri     39      Ranchi
3   Sameer     37  Vijayawada

In [19]:
df.to_csv('bhay.csv', index = False)

In [20]:
df.head(2)

      name  marks    city
0     Abhi     40  Mumbai
1  Samarth     42   Delhi

In [21]:
df.tail(2)

     name  marks        city
2   Kejri     39      Ranchi
3  Sameer     37  Vijayawada

In [22]:
df.describe()

           marks
count   4.000000
mean   39.500000
std     2.081666
min    37.000000
25%    38.500000
50%    39.500000
75%    40.500000
max    42.000000

In [23]:
train = pd.read_csv('train.csv')

In [24]:
train

   Train speed   no.        city
0           124   40      Mumbai
1           119   42       Delhi
2           103   39      Ranchi
3            94   37  Vijayawada

In [25]:
train['no.'][0]=50

C:\Users\abhic\AppData\Local\Temp\ipykernel_95344\3122905867.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  train['no.'][0]=50

In [31]:
train

   Train speed   no.        city
0           124   50      Mumbai
1           119   42       Delhi
2           103   39      Ranchi
3            94   37  Vijayawada

In [33]:
train.to_csv('train.csv' , index = False)

In [35]:
ser = pd.Series(np.random.rand(6))# creating a random series using pandas

In [36]:
ser

0    0.857892
1    0.079978
2    0.681063
3    0.230089
4    0.596026
5    0.769858
dtype: float64

In [37]:
ser[0] = 'Time'

In [38]:
ser

0        Time
1    0.079978
2    0.681063
3    0.230089
4    0.596026
5    0.769858
dtype: object

In [46]:
newdf = pd.DataFrame(np.random.rand(5,3))# To create a random data frame using pandas and numpy

In [47]:
newdf

          0         1         2
0  0.235379  0.883950  0.643066
1  0.342260  0.411046  0.888896
2  0.291821  0.031956  0.826270
3  0.295302  0.621186  0.037626
4  0.371404  0.665230  0.903105

In [48]:
newdf.to_numpy()# representing table as a numpy array

array([[0.23537896, 0.88395007, 0.64306637],
       [0.34226036, 0.4110456 , 0.88889556],
       [0.29182098, 0.03195638, 0.82626976],
       [0.29530178, 0.62118555, 0.03762602],
       [0.37140419, 0.66522959, 0.90310508]])

In [50]:
newdf.T#Transpose

          0         1         2         3         4
0  0.235379  0.342260  0.291821  0.295302  0.371404
1  0.883950  0.411046  0.031956  0.621186  0.665230
2  0.643066  0.888896  0.826270  0.037626  0.903105

In [51]:
newdf.sort_index(axis = 0 , ascending = False)# sorting the rows * axis 0 * in descending order , by default acsending

          0         1         2
4  0.371404  0.665230  0.903105
3  0.295302  0.621186  0.037626
2  0.291821  0.031956  0.826270
1  0.342260  0.411046  0.888896
0  0.235379  0.883950  0.643066

In [52]:
newdf.sort_index(axis = 1 , ascending = False)# sorting the columns * axis 1 * in descending order , by default acsending

          2         1         0
0  0.643066  0.883950  0.235379
1  0.888896  0.411046  0.342260
2  0.826270  0.031956  0.291821
3  0.037626  0.621186  0.295302
4  0.903105  0.665230  0.371404

In [53]:
newdf2 = newdf# it's a view of newdf and not a copy . Think of it as a pointer system.

In [54]:
newdf2[0][0] = 0.5

In [55]:
newdf

          0         1         2
0  0.500000  0.883950  0.643066
1  0.342260  0.411046  0.888896
2  0.291821  0.031956  0.826270
3  0.295302  0.621186  0.037626
4  0.371404  0.665230  0.903105

In [56]:
newdf3 = newdf.copy()# Here it formed a copy .Therefore newdf retained 0.5 and did not get changed to 0.75.

In [57]:
newdf3[0][0] = 0.75

In [58]:
newdf

          0         1         2
0  0.500000  0.883950  0.643066
1  0.342260  0.411046  0.888896
2  0.291821  0.031956  0.826270
3  0.295302  0.621186  0.037626
4  0.371404  0.665230  0.903105

In [60]:
newdf.loc[0,0] = 0.75 # To avoid confusion with view and copy we use 'loc' to change value.

In [61]:
newdf

          0         1         2
0  0.750000  0.883950  0.643066
1  0.342260  0.411046  0.888896
2  0.291821  0.031956  0.826270
3  0.295302  0.621186  0.037626
4  0.371404  0.665230  0.903105

In [63]:
newdf.columns = list('ABC')# to change column headings

In [64]:
newdf

          A         B         C
0  0.750000  0.883950  0.643066
1  0.342260  0.411046  0.888896
2  0.291821  0.031956  0.826270
3  0.295302  0.621186  0.037626
4  0.371404  0.665230  0.903105

In [65]:
newdf.columns = ['speed' , 'time' , 'distance']

In [66]:
newdf

      speed      time  distance
0  0.750000  0.883950  0.643066
1  0.342260  0.411046  0.888896
2  0.291821  0.031956  0.826270
3  0.295302  0.621186  0.037626
4  0.371404  0.665230  0.903105

In [67]:
newdf.loc[0,'speed'] = 0.959595

In [68]:
newdf

      speed      time  distance
0  0.959595  0.883950  0.643066
1  0.342260  0.411046  0.888896
2  0.291821  0.031956  0.826270
3  0.295302  0.621186  0.037626
4  0.371404  0.665230  0.903105

In [69]:
newdf.loc[[1,2] , ['time' , 'distance']] # To  access specific rows and columns

       time  distance
1  0.411046  0.888896
2  0.031956  0.826270

In [70]:
newdf.loc[[1,2] ,:]# particluar row or columnn use ':'

      speed      time  distance
1  0.342260  0.411046  0.888896
2  0.291821  0.031956  0.826270

In [72]:
newdf.drop(0 , axis = 0) # to drop a particular row or column

      speed      time  distance
1  0.342260  0.411046  0.888896
2  0.291821  0.031956  0.826270
3  0.295302  0.621186  0.037626
4  0.371404  0.665230  0.903105

In [74]:
newdf.loc[newdf['speed']<0.3]# check key with respect to some condition

      speed      time  distance
2  0.291821  0.031956  0.826270
3  0.295302  0.621186  0.037626

In [76]:
newdf.loc[(newdf['speed']<0.3) & (newdf['time']>0.5)]

      speed      time  distance
3  0.295302  0.621186  0.037626

In [77]:
newdf

      speed      time  distance
0  0.959595  0.883950  0.643066
1  0.342260  0.411046  0.888896
2  0.291821  0.031956  0.826270
3  0.295302  0.621186  0.037626
4  0.371404  0.665230  0.903105

In [78]:
newdf.iloc[0,0] = 0.75# iloc allows you to change value using index although name is different

In [79]:
newdf

      speed      time  distance
0  0.750000  0.883950  0.643066
1  0.342260  0.411046  0.888896
2  0.291821  0.031956  0.826270
3  0.295302  0.621186  0.037626
4  0.371404  0.665230  0.903105

In [81]:
newdf.drop([0])

      speed      time  distance
1  0.342260  0.411046  0.888896
2  0.291821  0.031956  0.826270
3  0.295302  0.621186  0.037626
4  0.371404  0.665230  0.903105

In [82]:
newdf

      speed      time  distance
0  0.750000  0.883950  0.643066
1  0.342260  0.411046  0.888896
2  0.291821  0.031956  0.826270
3  0.295302  0.621186  0.037626
4  0.371404  0.665230  0.903105

In [83]:
newdf.drop([0] , inplace = True)# drop does not make changes in the actual df , but with inplace option change is made.

In [84]:
newdf

      speed      time  distance
1  0.342260  0.411046  0.888896
2  0.291821  0.031956  0.826270
3  0.295302  0.621186  0.037626
4  0.371404  0.665230  0.903105

In [94]:
newdf.reset_index()

   index     speed      time  distance
0      1  0.342260  0.411046  0.888896
1      2  0.291821  0.031956  0.826270
2      3  0.295302  0.621186  0.037626
3      4  0.371404  0.665230  0.903105

In [95]:
newdf.reset_index(drop = True)

      speed      time  distance
0  0.342260  0.411046  0.888896
1  0.291821  0.031956  0.826270
2  0.295302  0.621186  0.037626
3  0.371404  0.665230  0.903105

In [103]:
freshdf = pd.DataFrame(np.random.rand (3,2))

In [104]:
freshdf

          0         1
0  0.058815  0.261533
1  0.658701  0.281791
2  0.731308  0.099015

In [114]:
freshdf.loc[:,[0]] = [33,34,45]

In [115]:
freshdf

    0         1
0  33  0.261533
1  34  0.281791
2  45  0.099015

In [127]:
freshdf.loc[: ,[1]] = [76,89,94]

In [119]:
freshdf

    0   1
0  33  76
1  34  89
2  45  94

In [120]:
freshdf.mean()

0    37.333333
1    86.333333
dtype: float64

In [121]:
freshdf.max()

0    45
1    94
dtype: int64

In [122]:
freshdf.std()

0    6.658328
1    9.291573
dtype: float64

In [124]:
freshdf.count()

0    3
1    3
dtype: int64

In [129]:
freshdf.loc[: ,[1]] = [76,89,None]

In [131]:
freshdf

    0     1
0  33  76.0
1  34  89.0
2  45   NaN

In [132]:
freshdf.count()

0    3
1    2
dtype: int64

In [ ]:
# df.iterrows() is used to iterate over the rows in a loop , takes in index , row parameters